Repository: uverdiazla/module-learn-digital-modulation-simulator
Catalog: lib/l10n/app_*.arb
Languages: es

# appTitle
source: Digital Modulation Simulator
es: Simulador de Modulación Digital

source: Enter Message
es: Ingrese Mensaje

# messageHint
source: Type a message to modulate (e.g., "Hello")
es: Escriba un mensaje para modular (ej: "Hola")

source: Modulation Type
es: Tipo de Modulación

source: Step-by-Step Mode
es: Modo Paso a Paso

source: Simulate
es: Simular

source: Previous
es: Anterior

source: Next
es: Siguiente

source: Reset
es: Reiniciar

source: Binary Representation:
es: Representación Binaria:

source: Signal Visualization:
es: Visualización de la Señal:

# about
source: About {modulationType}
es: Acerca de {modulationType}

source: Current bit:
es: Bit actual:

source: Current dibit:
es: Dibit actual:

source: Phase:
es: Fase:

source: Amplitude:
es: Amplitud:

source: Frequency:
es: Frecuencia:

source: Bit to Phase Mapping:
es: Mapeo de Bit a Fase:

source: Dibit to Phase Mapping:
es: Mapeo de Dibit a Fase:

source: Bit to Amplitude Mapping:
es: Mapeo de Bit a Amplitud:

source: Bit to Frequency Mapping:
es: Mapeo de Bit a Frecuencia:

source: Advantages:
es: Ventajas:

source: Disadvantages:
es: Desventajas:

# bpsk_advantage1
source: Simple to implement and demodulate
es: Simple de implementar y demodular

# bpsk_advantage2
source: Most robust against noise
es: Más robusta contra el ruido

# bpsk_advantage3
source: Less prone to errors in noisy channels
es: Menos propensa a errores en canales ruidosos

# bpsk_disadvantage1
source: Low spectral efficiency (1 bit per symbol)
es: Baja eficiencia espectral (1 bit por símbolo)

# qpsk_advantage1
source: Twice the spectral efficiency of BPSK (2 bits per symbol)
es: El doble de eficiencia espectral que BPSK (2 bits por símbolo)

# qpsk_advantage2
source: Same error rate as BPSK for the same energy per bit
es: Misma tasa de error que BPSK para la misma energía por bit

# qpsk_disadvantage1
source: More complex implementation and demodulation
es: Implementación y demodulación más complejas

# qpsk_disadvantage2
source: More sensitive to phase noise and distortion
es: Más sensible al ruido de fase y distorsión

# ask_advantage1
source: Simple to implement and understand
es: Simple de implementar y entender

# ask_advantage2
source: Low bandwidth requirements
es: Bajos requerimientos de ancho de banda

# ask_disadvantage1
source: Poor noise immunity compared to phase modulations
es: Poca inmunidad al ruido comparado con modulaciones de fase

# ask_disadvantage2
source: Susceptible to amplitude variations and fading
es: Susceptible a variaciones de amplitud y desvanecimiento

# fsk_advantage1
source: Better noise immunity than ASK
es: Mejor inmunidad al ruido que ASK

# fsk_advantage2
source: Less affected by signal strength variations
es: Menos afectada por variaciones en la intensidad de la señal

# fsk_advantage3
source: Simpler to demodulate than PSK in some cases
es: Más simple de demodular que PSK en algunos casos

# fsk_disadvantage1
source: Requires more bandwidth than PSK and ASK
es: Requiere más ancho de banda que PSK y ASK

# fsk_disadvantage2
source: Less spectral efficiency than multi-level modulations
es: Menor eficiencia espectral que modulaciones multinivel

source: Change Language
es: Cambiar Idioma

# bpsk_description
source: Binary Phase Shift Keying - Uses 2 phase states (0° and 180°) to represent binary 0 and 1
es: Modulación por Desplazamiento de Fase Binaria - Utiliza 2 estados de fase (0° y 180°) para representar los bits 0 y 1

# qpsk_description
source: Quadrature Phase Shift Keying - Uses 4 phase states (0°, 90°, 180°, 270°) to represent 2 bits per symbol
es: Modulación por Desplazamiento de Fase en Cuadratura - Utiliza 4 estados de fase (0°, 90°, 180°, 270°) para representar 2 bits por símbolo

# ask_description
source: Amplitude Shift Keying - Uses different amplitude levels to represent binary data, typically zero amplitude for bit 0 and non-zero for bit 1
es: Modulación por Desplazamiento de Amplitud - Utiliza diferentes niveles de amplitud para representar datos binarios, típicamente amplitud cero para el bit 0 y no cero para el bit 1

# fsk_description
source: Frequency Shift Keying - Uses different frequency levels to represent binary data, typically low frequency for bit 0 and high frequency for bit 1
es: Modulación por Desplazamiento de Frecuencia - Utiliza diferentes niveles de frecuencia para representar datos binarios, típicamente frecuencia baja para el bit 0 y alta para el bit 1

source: History
es: Historial

# historyEmpty
source: No modulation history yet
es: No hay historial de modulación aún

source: Save to History
es: Guardar en Historial

source: Delete History
es: Borrar Historial

# confirmDeleteHistory
source: Are you sure you want to delete all history?
es: ¿Está seguro que desea borrar todo el historial?

source: Yes
es: Sí

source: Cancel
es: Cancelar

source: Demodulation
es: Demodulación

# demodulationTitle
source: Signal Demodulation
es: Demodulación de Señal

source: Noise Level
es: Nivel de Ruido

# noiseDescription
source: Adding noise simulates real-world transmission conditions
es: Agregar ruido simula condiciones de transmisión del mundo real

source: Demodulate
es: Demodular

source: Original Message
es: Mensaje Original

source: Demodulated Message
es: Mensaje Demodulado

source: Accuracy
es: Precisión

source: Noise Impact
es: Impacto del Ruido

# errorRate
source: Error Rate: {rate}%
es: Tasa de Error: {rate}%

source: Transmission Process
es: Proceso de Transmisión

source: Modulation
es: Modulación

source: Transmission
es: Transmisión

source: Received Signal
es: Señal Recibida

source: View History
es: Ver Historial

source: Transmission Channel
es: Canal de Transmisión

source: Channel Noise
es: Ruido del Canal

# lowNoise
source: Low
es: Bajo

# mediumNoise
source: Medium
es: Medio

# highNoise
source: High
es: Alto

# extremeNoise
source: Extreme
es: Extremo

# historyTitle
source: Modulation History
es: Historial de Modulación

# noHistoryEntries
source: No history entries yet. Modulate a signal and save it to history.
es: No hay entradas en el historial aún. Module una señal y guárdela en el historial.

# selectHistoryEntry
source: Select a history entry to view details
es: Seleccione una entrada del historial para ver detalles

source: Clear All History
es: Borrar Todo el Historial

# clearAllHistoryConfirmation
source: Are you sure you want to delete all history entries? This action cannot be undone.
es: ¿Está seguro que desea borrar todas las entradas del historial? Esta acción no se puede deshacer.

source: Delete
es: Eliminar

source: Clear
es: Borrar

source: Delete Entry
es: Eliminar Entrada

# deleteEntryConfirmation
source: Are you sure you want to delete this entry?
es: ¿Está seguro que desea eliminar esta entrada?

source: Original Text
es: Texto Original

source: Timestamp
es: Marca de Tiempo

source: Demodulated Text
es: Texto Demodulado

# demodulationStepByStep
source: Step-by-Step Demodulation
es: Demodulación Paso a Paso

# demodulationProgress
source: Demodulation Progress: {progress}%
es: Progreso de Demodulación: {progress}%

source: Demodulation Complete
es: Demodulación Completa

# demodulationStep
source: Step {current} of {total}
es: Paso {current} de {total}

source: Character Comparison
es: Comparación de Caracteres

source: Demodulated
es: Demodulado

source: Errors
es: Errores

source: Show Comparison
es: Mostrar Comparación
